routes/web.php

SELECT * FROM `categories` WHERE `categories`.`id` in (2)
SELECT * FROM `posts` WHERE `posts`.`category_id` = 2 and `posts`.`category_id` IS not NULL
SELECT * FROM `posts` WHERE `posts`.`user_id` = 3 and `posts`.`user_id` IS not NULL
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2)
---
Route::get("/categories/{category:slug}",function(Category $category){
    return view("post",[
        "title" => "Post By Category : $category->name",
        "posts" => $category->content->load("author","category"),
    ]);
});

Route::get("/authors/{author:username}",function(User $author){
    return view("post",[
        "title" => "Post by Author: $author->name ",
        // untuk menghindari n +1 problem jika menggunakan teknik route model binding
        // hanya dengan menambahkan load() saja
        "posts" => $author->post->load("category","author"),
    ]);
});